{
  "documents" : [ {
    "id" : "bank_of_america_221",
    "type" : "ARTICLE",
    "title" : "When are my funds available after deposit?",
    "summary" : "The speed with which we make your deposited funds available depends on a number of factors, includin",
    "author" : "gks_super",
    "content" : {
      "description" : "The speed with which we make your deposited funds available depends on a number of factors, including how, when, and where you made your deposit. For example: By direct deposit: we credit your account on the day the deposit is scheduled to occur. In most cases, a direct deposit is the fastest and easiest way to get funds into your account. By wire transfer: we credit your account the day we receive it. Wire transfers typically have to be set up for each transfer. In most cases, there is a fee for sending or receiving a wire transfer, but it can be worth the expense since you know the money will be there when you need it. Cash with a teller or ATM: you can usually access it immediately at the teller or ATM. If you're not sure, ask your teller when the funds you deposited will be available. At an ATM (for Consumer Accounts): For check deposits, generally $200 of the deposit is available immediately, and the rest of your deposit is usually available the next business day. New accounts generally do not receive any immediate availability. For Business Accounts: check deposits are generally available the next business day. For more information on the circumstances under which a delay may occur, refer to the Deposit Agreement and Disclosures."
    },
    "categories" : [ "gbank_category_1" ]
  }, {
    "id" : "bank_of_america_222",
    "type" : "ARTICLE",
    "title" : "Where can I find out about Bank of America's debt ratings?",
    "summary" : "Our debt ratings are available in a summary of our corporate and bank ratings. All Bank of America r",
    "author" : "gks_super",
    "content" : {
      "description" : "Our debt ratings are available in a summary of our corporate and bank ratings. All Bank of America ratings are investment-grade ratin."
    },
    "categories" : [ "gbank_category_2" ]
  }, {
    "id" : "bank_of_america_223",
    "type" : "ARTICLE",
    "title" : "What is an Overdraft Protection Transfer fee?",
    "summary" : "An Overdraft Protection Transfer fee may be charged when a transaction overdraws your checking accou",
    "author" : "gks_super",
    "content" : {
      "description" : "An Overdraft Protection Transfer fee may be charged when a transaction overdraws your checking account and, as a result, available funds are transferred from your linked Overdraft Protection account to cover the amount."
    },
    "categories" : [ "gbank_category_3" ]
  }, {
    "id" : "bank_of_america_224",
    "type" : "ARTICLE",
    "title" : "Can I still overdraw my account if I have Overdraft Protection?",
    "summary" : "Yes, if there aren't enough funds in your checking account or linked account to cover an item, Overd",
    "author" : "gks_super",
    "content" : {
      "description" : "Yes, if there aren't enough funds in your checking account or linked account to cover an item, Overdraft Protection won't occur and you may be charged an overdraft item fee, an NSF: Returned Item fee or your transaction may be declined. That's why it's a good idea to make sure you have sufficient funds or available credit in your linked account in case you may need to use the funds."
    },
    "categories" : [ "gbank_category_4" ]
  }, {
    "id" : "bank_of_america_225",
    "type" : "ARTICLE",
    "title" : "As a servicemember who travels often, being able to pay my bills online from anywhere is very convenient. How can I set up online bill payments?",
    "summary" : "To set up our optional Bill Pay service, you need to enroll in Online Banking. Once enrolled, you ca",
    "author" : "gks_super",
    "content" : {
      "description" : "To set up our optional Bill Pay service, you need to enroll in Online Banking. Once enrolled, you can set up bill payments in advance, set up recurring payments for regular bills, track your payment history and more. If you have only an installment loan with us, you can go to the biller direct option in Online Banking and set up Bill Pay to your checking account at another bank. When you're setting up Bill Pay, you'll need to have copies of your paper bills handy so you can add merchants/payees into the system. Enroll now in Online Banking from Bank of America Learn more about online Bill Pay"
    },
    "categories" : [ "gbank_category_5" ]
  }, {
    "id" : "bank_of_america_226",
    "type" : "ARTICLE",
    "title" : "What is the corporate address?",
    "summary" : "Bank of America Corporate Center 100 North Tryon Street Charlotte, North Carolina 28255",
    "author" : "gks_super",
    "content" : {
      "description" : "Bank of America Corporate Center 100 North Tryon Street Charlotte, North Carolina 28255"
    },
    "categories" : [ "gbank_category_6" ]
  }, {
    "id" : "bank_of_america_227",
    "type" : "ARTICLE",
    "title" : "Which employees can participate in a SIMPLE (savings incentive match plan for employees) IRA?",
    "summary" : "Employers who offer a SIMPLE IRA plan must make it available to all employees who expect to earn at ",
    "author" : "gks_super",
    "content" : {
      "description" : "Employers who offer a SIMPLE IRA plan must make it available to all employees who expect to earn at least $5,000 in compensation during the calendar year and have earned at least $5,000 with that employer in any 2 preceding calendar years. An employer may decide to set less restrictive requirements, making the plan available to more employees. Employee participation is voluntary."
    },
    "categories" : [ "gbank_category_7" ]
  }, {
    "id" : "bank_of_america_228",
    "type" : "ARTICLE",
    "title" : "How much does a safe deposit box cost?",
    "summary" : "The cost varies by the size of the box. Locate your nearest banking center to inquire about safe dep",
    "author" : "gks_super",
    "content" : {
      "description" : "The cost varies by the size of the box. Locate your nearest banking center to inquire about safe deposit box availability and pricing."
    },
    "categories" : [ "gbank_category_3" ]
  } ]
}